package com.company.Lessons.les18homeWork;
//Создайте зоопарк. У вас есть животные, которые там находятся. У каждого животного есть имя.
// Также есть метод, который возвращает звук этого животного.
//В зоопарке есть метод, вызвав который вам вернет количество животных и все их звуки.
// Как должен выглядеть main метод (например):

public class Animal {
    private String name;


    public String getName() {
        return name;
    }

    public void soundOff(){
        System.out.println(" ");
    }
}
